#+STARTUP: overview indent inlineimages logdrawer
#+TITLE:  Alfredo's MAC0110 Journal
#+AUTHOR:      Alfredo Goldman
#+LANGUAGE:    bt-br
#+TAGS: noexport(n) Stats(S)
#+TAGS: Teaching(T) R(R) OrgMode(O) Python(P)
#+TAGS: Book(b) Code(C) FPGA(F) Autotuning(A)
#+TAGS: ExportableReports(E)
#+TAGS: DataVis(v) PaperReview(W)
#+EXPORT_SELECT_TAGS: Blog
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+COLUMNS: %25ITEM %TODO %3PRIORITY %TAGS
#+SEQ_TODO: TODO(t!) STARTED(s!) WAITING(w@) APPT(a!) | DONE(d!) CANCELLED(c!) DEFERRED(f!)

#+LATEX_CLASS_OPTIONS: [a4paper]
#+LATEX_HEADER: \usepackage[margin=2cm]{geometry}
#+LATEX_HEADER: \usepackage{amsmath,amsfonts,amssymb,amsthm}
#+LATEX_HEADER: \usepackage{sourcecodepro}
#+LATEX_HEADER: \usepackage[utf8]{inputenc}
#+LATEX_HEADER: \usepackage{booktabs}
#+LATEX_HEADER: \usepackage{array}
#+LATEX_HEADER: \usepackage{colortbl}
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \usepackage{algpseudocode}
#+LATEX_HEADER: \usepackage{algorithm}
#+LATEX_HEADER: \usepackage{graphicx}
#+LATEX_HEADER: \usepackage[english]{babel}
#+LATEX_HEADER: \usepackage[scale=2]{ccicons}
#+LATEX_HEADER: \usepackage{hyperref}
#+LATEX_HEADER: \usepackage{relsize}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{bm}
#+LATEX_HEADER: \usepackage{amsfonts}
#+LATEX_HEADER: \usepackage{wasysym}
#+LATEX_HEADER: \usepackage{float}
#+LATEX_HEADER: \usepackage{ragged2e}
#+LATEX_HEADER: \usepackage{textcomp}
#+LATEX_HEADER: \usepackage{pgfplots}
#+LATEX_HEADER: \usepackage{todonotes}
#+LATEX_HEADER: \usepgfplotslibrary{dateplot}
#+LATEX_HEADER: \lstdefinelanguage{ein-julia}%
#+LATEX_HEADER:   {morekeywords={abstract,struct,break,case,catch,const,continue,do,else,elseif,%
#+LATEX_HEADER:       end,export,false,for,function,immutable,mutable,using,import,importall,if,in,%
*** Começando com o modo interativo do Julia.
Quem quiser já pode instalar o ambiente de programação, usem esse [[https://julialang.org/][link]]

Dentro do Julia (após chamar julia na linha de comando), vamos começar com números inteiros:
#+NAME: 12228cf8-4dae-4454-8494-6e712c891426
#+begin_SRC ein-julia :results output :session localhost :async yes
1 + 2
#+end_SRC

#+RESULTS: 12228cf8-4dae-4454-8494-6e712c891426
: 3

#+RESULTS:
: 3

#+begin_SRC ein-julia :results output :session localhost :async yes
40 * 3
#+end_SRC

#+RESULTS:
: 120

#+begin_SRC ein-julia :results output :session localhost :async yes
84 / 2
#+end_SRC
Notem que nesse caso, houve uma mudança de tipos, pois 84 e 2 são inteiros e o resultado
é um número em ponto flutuante (float)
#+RESULTS:
: 42.0

Também é possível pedir o resultado inteiro usando o operador div:
#+begin_SRC ein-julia :results output :session localhost :async yes
div(84,2)
#+end_SRC

#+RESULTS:
: 42

Também dá para fazer a exponenciação:

#+begin_SRC ein-julia :results output :session localhost :async yes
2^31
#+end_SRC

#+RESULTS:
: 2147483648
 Expressões mais complexas também podem ser calculadas:

 #+begin_SRC ein-julia :results output :session localhost :async yes
23 + 2 * 2 + 3 * 4
 #+end_SRC

 #+RESULTS:
 : 39
 Sim, a precedência de operadores usual também é válida em Julia. Mas, ai
vem a primeira lição de programação: * Escreva para humanos, não para máquinas *

 #+begin_SRC ein-julia :results output :session localhost :async yes
23 + (2 * 2) + (3 * 4)
 #+end_SRC

Em julia também podemos fazer operações com números em ponto flutuante:

#+begin_SRC ein-julia :results output :session py :async yes
23.5 * 3.14
#+end_SRC

#+RESULTS:
: 73.79

ou
#+begin_SRC ein-julia :results output :session localhost :async yes
12.5 / 2.0
#+end_SRC

#+RESULTS:
: 6.25

Acima temos mais um exemplo de código escrito para pessoas, ao se escrever
2.0 estamos deixando claro que o segundo parâmetro é um número float.

É importante saber que números em ponto flutuante tem precisão limitada, logo não se espante com resultados inesperados como abaixo:

#+NAME: 62234de1-001d-4390-97af-e5ad203ac125
#+begin_SRC ein-julia :results output :session localhost
1.2 - 1.0
#+end_SRC

#+RESULTS: 62234de1-001d-4390-97af-e5ad203ac125
: [....]

ou
#+NAME: a9808540-b252-4b3e-80cf-f65127b343f5
#+begin_SRC ein-julia :results output :session localhost
0.1 + 0.2
#+end_SRC

#+RESULTS: a9808540-b252-4b3e-80cf-f65127b343f5
: [....]

ou ainda

#+NAME: e02fa7e7-b7b7-405c-9b89-fdb8f370bbb1
#+begin_SRC ein-julia :results output :session localhost
10e15 + 1 - 10e15
#+end_SRC

#+RESULTS: e02fa7e7-b7b7-405c-9b89-fdb8f370bbb1
: 0.0

Um outro operador interessante é o % que faz o resto da divisão

#+NAME: 4e403942-5d45-473a-90be-9b02690bbb25
#+begin_SRC ein-julia :results output :session localhost
4 % 3
#+end_SRC

#+RESULTS: 4e403942-5d45-473a-90be-9b02690bbb25
: 1

*** Variáveis e seus tipos
Em Julia também temos o conceito de variáveis, que servem para armazenar os
diferentes conteúdos de dados possíveis.

#+NAME: 0571e6f9-2ce1-4e7f-b0ae-408686fe4fb2
#+begin_SRC ein-julia :results output :session localhost :async yes
a = 7
2 + a
#+end_SRC

#+RESULTS: 0571e6f9-2ce1-4e7f-b0ae-408686fe4fb2
: 9

É importante notar que as variáveis em Julia podem receber novos valores e o tipo
da variável depende do que foi atrubuído inicialmente.

#+NAME: 7f85f7ed-67f8-44e7-bd41-a5e59e70f3f8
#+begin_SRC ein-julia :results output :session localhost :async
a = 3
a = a + 1
typeof(a)
#+end_SRC

#+RESULTS: 7f85f7ed-67f8-44e7-bd41-a5e59e70f3f8
: Int64

Aproveitando o momento, podemos ver que há vários tipos primitivos em Julia, sendo os
principais:

#+NAME: c715ca40-1dbb-46af-811f-e4432ae8ac0f
#+begin_SRC ein-julia :results output :session localhost :async yes :exports both
typeof(1)
typeof(1.1)
typeof("Bom dia")
#+end_SRC

#+RESULTS: c715ca40-1dbb-46af-811f-e4432ae8ac0f
: String

Falando em strings, elas são definidas por conjuntos de caracteres entre aspas como:
#+NAME: 573261b3-3e9a-43f6-ae48-3e8eb6cb86bb
#+begin_SRC ein-julia :results output :session localhost
s1 = "Olha que legal"
s2 = "Outra String"
#+end_SRC

#+RESULTS: 573261b3-3e9a-43f6-ae48-3e8eb6cb86bb
: "Outra String"

Dá também para fazer operações como strings como concatenação:

#+NAME: 60e75287-87fb-47e0-bc02-d56dc5cddde9
#+begin_SRC ein-julia :results output :session localhost
s1 = "Tenha um"
s2 = " Bom dia"
s3 = s1 * s2
#+end_SRC

#+RESULTS: 60e75287-87fb-47e0-bc02-d56dc5cddde9
: "Tenha um Bom dia"

Ou potência:

#+NAME: aa619a34-1c8d-4636-a7b5-2ae7bb8681ef
#+begin_SRC ein-julia :results output :session localhost
s = "Nao vou mais fazer coisas que possam desagradar os meus colegas"
s ^ 10
#+end_SRC

#+RESULTS: aa619a34-1c8d-4636-a7b5-2ae7bb8681ef
: [....]

Ainda sobre variáveis, há umas regras com relação aos seus nomes, tem que
começar com uma letra, pode ter dígitos e não pode ser uma palavra reservada.  É
bom notar que Julia por ser uma linguagem moderna, aceita nomes de caracteres em
unicode, pode exemplo

#+begin_SRC ein-julia :results output :async yes
\delta = 2  # Para se fazer o delta, deve se digitar \ seguido de delta, seguido de <tab>
#+end_SRC
*** Saída de dados
Para fazer saídas usam-se dois comandos, print() e o println(), sendo que o primeiro não pula linha e o segundo pula.
#+NAME: cab1bf67-75d1-441d-a756-7c1b1a3220de
#+begin_SRC ein-julia :results output :session localhost :async yes
print("Hello ")
println("World!")
println("Ola, mundo!")
#+end_SRC

#+RESULTS: cab1bf67-75d1-441d-a756-7c1b1a3220de

Para evitar que se digitem muitos caracteres, por vezes podemos usar "açucares sintáticos".

#+NAME: af7bbe44-209e-46a6-9b53-4cf52ccf8533
#+begin_SRC ein-julia :results output :session localhost
x = 1
x = x + 1
x += 1  # forma equivalente a acima
#+end_SRC

#+RESULTS: af7bbe44-209e-46a6-9b53-4cf52ccf8533
: 3

*** O uso de funções é uma abstração natural
Na aula passada já vimos umas funções e isso foi bem natural, foram elas:
- typeof() - Que dado um parâmetro devolve o seu tipo
- div() - Que dados dois parâmetros devolve a divisão inteira do primeiro pelo segundo
- print() e println() - Que dados diversos parâmetros os imprime, sem devolver nada
Inclusive, aqui vale a pena ver que podemos pedir ajuda ao Julia para saber o que fazem as
funções. Para isso, se usa o ? antes da função:
#+NAME: 1d02325a-f2a1-4175-8903-f509560cc245
#+begin_SRC ein-julia :results output :session localhost :async yes
?typeof()
?div()
?print()
#+end_SRC

#+RESULTS: 1d02325a-f2a1-4175-8903-f509560cc245
:
:
:   No documentation found.
:
:   Binding [36mtypeof() ?div() ?print()[39m does not exist.

Ao fazer isso, inclusive descobrimos que o div() pode ser usado também como \div.

Uma outra função bem útil é a que permite transformar um tipo de valor em outro.

#+NAME: 91a6eaca-2a85-4d05-a699-3707ce5c2a8f
#+begin_SRC ein-julia :results output :session localhost
parse(Float64, "32")
#+end_SRC

#+RESULTS: 91a6eaca-2a85-4d05-a699-3707ce5c2a8f
: 32.0

Para conversão de valores em ponto flutuante para inteiros, temos a função trunc.

#+NAME: a2c1f3da-d8f1-4d85-9d34-47113b32d716
#+begin_SRC ein-julia :results output :session localhost
trunc(Int64, 2.25)
#+end_SRC

#+RESULTS: a2c1f3da-d8f1-4d85-9d34-47113b32d716
: 2

De forma inversa temos o float.

#+NAME: 7810375a-7fd9-4fb3-bc89-6e02b3464f4c
#+begin_SRC ein-julia :results output :session localhost
float(2)
#+end_SRC

#+RESULTS: 7810375a-7fd9-4fb3-bc89-6e02b3464f4c
: 2.0

Finalmente, podemos transformar um valor em uma string, como em:

#+NAME: 1a904e1c-4613-4bb1-a574-2a2017aadfbc
#+begin_SRC ein-julia :results output :session localhost
string(3)
#+end_SRC

#+RESULTS: 1a904e1c-4613-4bb1-a574-2a2017aadfbc
: "3"
ou
#+NAME: 3a4b773d-d0c1-425d-8681-65c88a759726
#+begin_SRC ein-julia :results output :session localhost
string(3.57)
#+end_SRC

#+RESULTS: 3a4b773d-d0c1-425d-8681-65c88a759726
: "3.57"

Também tem muitas funções matemáticas prontas como
- sin(x) - calcula  seno de x em radianos
- cos(x)
- tan(x)
- deg2rad(x) - converte x de graus em radianos
- rad2deg(x)
- log(x) - calcula o logarítmo natural de x
- log(x, b) - calcula o logarítmo de x na base b
- log2(x) - calcula o logarítmo de x na base 2
- log10(x)
- exp(x) - calcula o expoente da base natural de x
- abs(x) - calcula o módulo de x
- sqrt(x) - calcula a raiz quadrada
- isqrt(x) - calcula a raiz quadrada inteira de x
- cbrt(x) - raiz cúbica de x
- factorial(x) - calcula o fatorial de x

Em julia também é possível criar funções conforme as suas necessidades, como abaixo:
#+NAME: 8f733746-e1b4-4a37-92b3-ae495090f020
#+begin_SRC ein-julia :results output :session localhost
function mensagemDeBomDia()
   println("Tenha um bom dia!")
end
#+end_SRC

#+RESULTS: 8f733746-e1b4-4a37-92b3-ae495090f020
: mensagemDeBomDia (generic function with 1 method)

Para usar uma função, basta chamá-la:

#+NAME: 5a983c1d-fbec-4f99-978a-7187dcb44a30
#+begin_SRC ein-julia :results output :session localhost
MensagemDeBomDia()
#+end_SRC

#+RESULTS: 5a983c1d-fbec-4f99-978a-7187dcb44a30


Funções, podem receber um ou mais parâmetros:

#+NAME: aa31a96d-c645-4598-9502-b97640374f82
#+begin_SRC ein-julia :results value :session localhost
function imprime(a)
   println(" Vou imprimir ", a)
end
imprime(42)
#+end_SRC

#+RESULTS: aa31a96d-c645-4598-9502-b97640374f82

Também é possível que uma função chame outra funçõa como em:

#+NAME: fab1fb94-6596-4001-94c4-1dad607e9546
#+begin_SRC ein-julia :results output :session localhost
function imprimeduasvezes(a)
   imprime(a)
   imprime(a)
end
imprimeduasvezes(13)
#+end_SRC

#+RESULTS: fab1fb94-6596-4001-94c4-1dad607e9546
O número de parâmetros determina qual a função correta deve ser chamada:
#+NAME: b0af26b3-0aba-4247-a13b-5ff581119f84
#+begin_SRC ein-julia :results output :session localhost
function recebe(a)
  println("Recebi um parametro: ", a)
end
function recebe(a, b)
  println("Recebi dois parametros: ", a, " ", b)
end

#+end_SRC

#+RESULTS: b0af26b3-0aba-4247-a13b-5ff581119f84
: recebe (generic function with 2 methods)

Conforme a chamada, a função chamada será diferente:

#+NAME: e828de2d-ece2-4d0a-b88b-abbbe5b2a701
#+begin_SRC ein-julia :results output :session localhost
recebe(1)
recebe(1, 2)
#+end_SRC

#+RESULTS: e828de2d-ece2-4d0a-b88b-abbbe5b2a701
Também dá para chamar funções com variáveis e com operações, como
em:

#+NAME: 89cea054-ece5-40d7-ac31-a652f461d94b
#+begin_SRC ein-julia :results output :session localhost
a = 10
recebe(a)
recebe(a, a + 1)

#+end_SRC

#+RESULTS: 89cea054-ece5-40d7-ac31-a652f461d94b

As funções que vimos até agora imprimem mensagens, mas não devolvem nada.
O typeof() delas é nothing, ou seja, algo que não pode ser atribuído.

Mas, também é possível fazer funções que devolvem valores, como:

#+begin_SRC ein-julia :results output :session localhost
function soma1(a)
  return a + 1
end
#+end_SRC

Nesse caso, se for passado um parâmetro numérico, a função devolverá o valor incrementado (adicionado de 1).

Claro que isso pode ser usado com fórmulas mais complicadas como:

#+begin_SRC ein-julia :results output :session localhost
function hipotenusa(a, b)
  hip = a * a + b * b
  return hip
end
#+end_SRC
ou para a verificação de fórmulas, como relações trogonométricas:
#+begin_SRC ein-julia :results output :session localhost
function verificaequacao(x)
  soma = sin(x)^2 + cos(x)^2
  return soma == 1.0
end
#+end_SRC
** Aula 05 - <2020-03-16 seg>
  Nessa aula, em meio ao caos de uma pandemia mundial, vamos aprender um novo comando.
O desvio condicional, através dele é possível alterar o fluxo de execução de um programa. Até o
momento não tínhamos comentado isso explicitamente, mas a ordem de execução de instruções segue
a ordem em que elas estão. Vejamos o exemplo abaixo:
#+NAME: cdbb133a-e6e7-4d78-bd70-8d7d41b5a949
#+begin_SRC ein-julia :results output :session localhost
println("Oi")
println("um")
println("dois")
#+end_SRC

#+RESULTS: cdbb133a-e6e7-4d78-bd70-8d7d41b5a949
: [....]

A ordem de impressão será Oi, um e dois.

Da mesma forma não temos problema ao executar o código abaixo.

#+NAME: e03586b7-6414-4a10-b43a-fd5345210d51
#+begin_SRC ein-julia :results output :session localhost
denominador = 0
denominador += 2
30 / denominador
#+end_SRC

#+RESULTS: e03586b7-6414-4a10-b43a-fd5345210d51
: [....]

Apesar da variável denominador começar inicialmente com 0, antes de se fazer a
divisão, ela estará valendo 2.

Como é de se esperar nem sempre queremos que essa ordem seja respeitada. Observe
o seguinte exemplo:

#+NAME: c8e3e174-d6fa-4175-a0ef-b572509afd3e
#+begin_SRC ein-julia :results output :session localhost
pandemia = true
println("Vou sair de casa?")
if pandemia == true
   println("Só vou sair de casa se for essencial")
end

#+end_SRC

#+RESULTS: c8e3e174-d6fa-4175-a0ef-b572509afd3e
: [....]
 O exemplo acima é claro, se uma condição for verdadeira, o código que
 está no escopo do if (isso é entre a condição e o end) será executado.

 Um outro exemplo:

 #+NAME: b7a9a3c7-cf10-41dc-9405-64e688e3d89a
 #+begin_SRC ein-julia :results output :session localhost
denominador = 0
if denominador != 0
   println("sei fazer a divisão se não for por zero")
   println("o resultado da divisão de 30 por ", denominador, " é igual a ", 30/denominador)
end


 #+end_SRC

 #+RESULTS: b7a9a3c7-cf10-41dc-9405-64e688e3d89a
 : [....]

 Situações muito comuns em computação devem ser favorecidas pela linguagem, nesse
caso do if, é muito comum termos duas ou mais situações. Nesse sentido em Julia podemos
também ter alternativas como abaixo:

 #+NAME: b363cb59-d5d8-449b-8474-f325b3b48db2
 #+begin_SRC ein-julia :results output :session localhost
pandemia = true
println("Vou sair de casa?")
if pandemia == true
   println("Só vou sair de casa se for essencial")
else
   println("Balada liberada")
end
 #+end_SRC

 #+RESULTS: b363cb59-d5d8-449b-8474-f325b3b48db2

No caso de termos mais de uma altenativa, não basta termos só uma condição,
nesse caso temos que usar elseif.

#+NAME: 2fa54533-0cf8-4cb4-b251-434a024649f1
#+begin_SRC ein-julia :results output :session localhost
pandemia = true
tenhoqueestudar = false
println("Vou sair de casa?")
if pandemia == true
   println("Só vou sair de casa se for essencial")
elseif tenhoqueestudar == true
   println("Melhor ficar em casa")
else
   println("Balada liberada")
end
#+end_SRC

#+RESULTS: 2fa54533-0cf8-4cb4-b251-434a024649f1
: [....]

 Conhecendo o if, agora, escreva uma função que recebe os coeficientes, a, b e c de uma
equação de segundo grau e imprime as suas raízes reais.

 Espaço para a solução aqui :)

 Vamos agora a parte mais importante da aula, lembrando que até o momento aprendemos:
**** como mudar o fluxo de execução normal com o if, elseif


Mas, agora vem a dúvida, uma função pode se chamar?

#+NAME: e3d35c28-d40a-4ce2-aac4-8bee3537ac95
#+begin_SRC ein-julia :results output :session localhost
function imprime()
  println("Mensagem")
  imprime()
end
#+end_SRC

#+RESULTS: e3d35c28-d40a-4ce2-aac4-8bee3537ac95
: [....]

O resultado da função é curioso, ela vai ficar se chamando até uma memória do computador
acabar (para quem conhece é a pilha ou stack). Mas, será que podemos usar isso de forma
mais inteligente ao nosso favor? Isso é, em algum momento a função teria que parar de se chamar
de forma a não acabar com erro.

Uma forma de se fazer isso é através de um comando como o if, que pode ou não seguir
chamando a função, mas para isso vamos precisar receber um parâmetro.

#+begin_SRC ein-julia :results output :session localhost
function countdown(n)
  println(n)
  if n > 0
    countdown(n-1)
  else
    println("Acabou")
  end
end
countdown(10)
#+end_SRC
 Para entender um pouco melhor o que acontece acima, vamos colocar mais umas
impressões.

 #+begin_SRC ein-julia :results output :session localhost
function countdown(n)
  println(n)
  if n > 0
    println("Vou chamar countdown com n = ", n - 1)
    countdown(n-1)
    println("Voltei da chamada com n = ", n - 1)
  else
    println("Acabou")
  end
end
countdown(10)
 #+end_SRC

Observando a sequência de chamadas, fica claro como funciona o computador, de alguma forma,
cada uma das chamadas é empilhada (colocada em um estrutura como uma pilha, de livros, mas
no caso de chamadas de função), sendo que no final são desempilhadas.

Vou desenhar para o caso countdown(5).

Essa estrutura é bem poderosa, pois permite que operações sejam executadas um número controlado de vezes.
Voltando ao countdown, imagine que ao invés de imprimir uma mensagem quiséssemos fazer uma conta com o que será
devolvido.

#+begin_SRC ein-julia :results output :session localhost
function soma(n)
  if n > 0
    return n + soma(n - 1)
  else
    return 1
  end
end
soma(10)
#+end_SRC

 Essa estrutura é bastante poderosa e pode ser usada para o cálculo de produto, nesse
caso, a mudança é bem pequena.

Da mesma forma segue um exemplo para o cálculo dos n primeiros elementos da soma
hârmonica.

#+NAME: cde2230d-c34c-424c-85cf-38b66e823af3
#+begin_SRC ein-julia :results output :session localhost
function somaharmonica(atual, n)
  if atual >= n
    return 1.0 / atual
  else
    return 1.0 / atual + somaharmonica(atual + 1, n)
  end
end
somaharmonica(1, 10)
#+end_SRC

#+RESULTS: cde2230d-c34c-424c-85cf-38b66e823af3
: [....]

 O miniEP para a próxima semana será:
